railsdictionary/railsdictionary/app/controllers/definitions_controller.rb

  def index
    @definitions = Definition.all
---
SELECT "definitions".* FROM "definitions"

  def create
    @definition = Definition.new(definition_params)

    respond_to do |format|
      if @definition.save
---
INSERT INTO "definitions" ("word", "meaning", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["word", "Rails"], ["meaning", "is AWESOME"], ["created_at", "2015-09-29 18:10:40.441801"], ["updated_at", "2015-09-29 18:10:40.441801"]]

  def update
    respond_to do |format|
      if @definition.update(definition_params)
---
UPDATE "definitions" SET "word_type" = ?, "updated_at" = ? WHERE "definitions"."id" = ?  [["word_type", "noun"], ["updated_at", "2015-10-01 03:36:31.734812"], ["id", 1]]

  def destroy
    @definition.destroy
---
DELETE FROM "definitions" WHERE "definitions"."id" = ?  [["id", 1]]

    def set_definition
      @definition = Definition.find(params[:id])
---
SELECT  "definitions".* FROM "definitions" WHERE "definitions"."id" = ? LIMIT 1  [["id", nil]]